%% by Xindong Zhang %%
%% ---2015-03-25----%%

close all;
clear all;
clc;

words = cell(1,3);
words{1} = ['我','爱','北','京','天','安','门', ...
            '天','安','门','上','太','阳','升', ...
            '伟','大','领','袖','毛','泽','东', ...
            '指','领','我','们','向','前','进'];
words{2} = ['北京','太阳','伟大','领袖','指领','我们','向前'];
words{3} = ['天安门','毛泽东'];
TrainData  = '我爱北京天安门天安门上太阳升伟大领袖毛泽东指领我们向前进';
TrainLabel = ['S','S','B','E','B','M','E', ...
              'B','M','E','S','B','E','S', ...
              'B','E','B','E','B','M','E', ...
              'B','E','B','E','B','E','S'];
Label      = ['B', 'M', 'E', 'S'];

[W,~] = CRF(TrainData, TrainLabel, Label);




